CalculaShip/app/controllers/costs_controller.rb

    def set_cost
      @cost = Cost.find(params[:id])
---
SELECT "costs".* FROM "costs" WHERE "costs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]