distancia/app/controllers/api/v1/distancias_controller.rb

SELECT "distances".* FROM "distances"
---
  def index
    @distancias = Distance.all

SELECT "distances".* FROM "distances" WHERE "distances"."origem" = ? AND "distances"."destino" = ? LIMIT ?  [["origem", "Z"], ["destino", "Y"], ["LIMIT", 1]]
---
  def buscar
     @distancia =  Distance.find_by origem: params['origem'], destino: params['destino']

INSERT INTO "distancia" ("origem", "destino", "distancia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["origem", "A"], ["destino", "B"], ["distancia", 20], ["created_at", "2019-09-11 02:06:29.409863"], ["updated_at", "2019-09-11 02:06:29.409863"]]
---
  def update
    @distancia.update(distancia_params)
    if @distancia.save

SELECT "distances".* FROM "distances" WHERE "distances"."origem" = ? AND "distances"."destino" = ? LIMIT ?  [["origem", "A"], ["destino", "C"], ["LIMIT", 1]]
UPDATE "distances" SET "distancia" = ?, "updated_at" = ? WHERE "distances"."id" = ?  [["distancia", "25"], ["updated_at", "2019-09-15 19:27:11.206167"], ["id", 5]]
INSERT INTO "distancia" ("origem", "destino", "distancia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["origem", "A"], ["destino", "B"], ["distancia", 20], ["created_at", "2019-09-11 02:06:29.409863"], ["updated_at", "2019-09-11 02:06:29.409863"]]
INSERT INTO "distances" ("origem", "destino", "distancia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["origem", "A"], ["destino", "C"], ["distancia", "25"], ["created_at", "2019-09-15 19:14:35.812710"], ["updated_at", "2019-09-15 19:14:35.812710"]]
---
  def create
    @distancia =  Distance.find_by origem: params['origem'], destino: params['destino']
    if @distancia
       @distancia.update(distancia_params)
    else
       @distancia = Distance.new(distancia_params)
    end
    if @distancia.save

SELECT "distances".* FROM "distances" WHERE "distances"."origem" = ? AND "distances"."destino" = ? LIMIT ?  [["origem", "Z"], ["destino", "Y"], ["LIMIT", 1]]
---
  def set_distancia
    @distancia = Distance.find_by origem: params['origem'], destino: params['destino']