app/controllers/ships_controller.rb

SELECT "ships".* FROM "ships"
---
  def index
    @ships = Ship.all

SELECT "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_ship
      @ship = Ship.find(params[:id])